koweda/stm32f249_SideProject/F429_RFID/User/lcd/bsp_lcd.h
/** @defgroup STM32F429I_DISCOVERY_LCD_Exported_Types
  * @{
  */
typedef struct
{
  int16_t X;
  int16_t Y;
} Point, * pPoint;
/**
  * @}
  */

/** @defgroup stm32f429i_discovery_LCD_Exported_Constants
  * @{
  */

/* LCD Size (Width and Height) */
#define  LCD_PIXEL_WIDTH       ((uint16_t)800)
#define  LCD_PIXEL_HEIGHT      ((uint16_t)480)

#define LCD_FRAME_BUFFER       ((uint32_t)0xD0000000)
#define BUFFER_OFFSET          ((uint32_t)800*480*2)


/**
  * @brief  LCD color
  */
/*
 *   使用以下兩組顏色必須跟LCD_LayerInit()函數中對每層的設置對應，不然會導致顏色顯示錯誤。
 * 特別為實現兩層同時正常顯示需要把上層(LCD_FOREGROUND_LAYER)設置為LTDC_Pixelformat_ARGB1555
 * 格式，對應的必須使用LCD_COLOR1555_XXX顏色，該格式在1位透明控制位，可以實現沒有實際顏色填
 * 充的圖元點通透顯示,從而使得顯示下層(LCD_BACKGROUND_LAYER)成為可能。如果上層是使用
 * LTDC_Pixelformat_ARGB565格式設置是無法正常顯示雙層的。
 *   當然，可以把下層設置為LTDC_Pixelformat_ARGB1555格式，使用用LCD_COLOR1555_XXX也是可以正
 * 常顯示的。
 * 特別注意：ARGB1555其中的A對應開發板液晶來說設置為1表示不透明，設置為0表透明。
*/
                                                   //RGB565
#define LCD_COLOR565_WHITE           0xFFFF        //11111 111111 11111
#define LCD_COLOR565_BLACK           0x0000        //00000 000000 00000
#define LCD_COLOR565_GREY            0xF7DE        //11110 111110 11110
#define LCD_COLOR565_BLUE            0x001F        //00000 000000 11111
#define LCD_COLOR565_BLUE2           0x051F        //00000 101000 11111
#define LCD_COLOR565_RED             0xF800        //11111 000000 00000
#define LCD_COLOR565_MAGENTA         0xF81F        //11111 000000 11111
#define LCD_COLOR565_GREEN           0x07E0        //00000 111111 00000
#define LCD_COLOR565_CYAN            0x7FFF        //01111 111111 11111
#define LCD_COLOR565_YELLOW          0xFFE0        //11111 111111 00000

                                                   //ARGB1555
#define LCD_COLOR1555_WHITE          0xFFFF        //1 11111 11111 11111
#define LCD_COLOR1555_BLACK          0x8000        //1 00000 00000 00000
#define LCD_COLOR1555_GREY           0xFBFE        //1 11110 11111 11110
#define LCD_COLOR1555_BLUE           0x801F        //1 00000 00000 11111
#define LCD_COLOR1555_BLUE2          0x829F        //1 00000 10100 11111
#define LCD_COLOR1555_RED            0xFC00        //1 11111 00000 00000
#define LCD_COLOR1555_MAGENTA        0xFC1F        //1 11111 00000 11111
#define LCD_COLOR1555_GREEN          0x83E0        //1 00000 11111 00000
#define LCD_COLOR1555_CYAN           0xBFFF        //1 01111 11111 11111
#define LCD_COLOR1555_YELLOW         0xFFE0        //1 11111 11111 00000
#define LCD_COLOR1555_CLEAR               0


/*預設顏色，RGB565與RGB888通用介面*/
#define LCD_COLOR_WHITE          LCD_COLOR1555_WHITE
#define LCD_COLOR_BLACK          LCD_COLOR1555_BLACK
#define LCD_COLOR_GREY           LCD_COLOR1555_GREY
#define LCD_COLOR_BLUE           LCD_COLOR1555_BLUE
#define LCD_COLOR_BLUE2          LCD_COLOR1555_BLUE2
#define LCD_COLOR_RED            LCD_COLOR1555_RED
#define LCD_COLOR_MAGENTA        LCD_COLOR1555_MAGENTA
#define LCD_COLOR_GREEN          LCD_COLOR1555_GREEN
#define LCD_COLOR_CYAN           LCD_COLOR1555_CYAN
#define LCD_COLOR_YELLOW         LCD_COLOR1555_YELLOW

#define TRANSPARENCY 							0x7FFF	//透明

/**
  * @brief  LCD Lines depending on the chosen fonts.
  */
#define LCD_LINE_0               LINE(0)
#define LCD_LINE_1               LINE(1)
#define LCD_LINE_2               LINE(2)
#define LCD_LINE_3               LINE(3)
#define LCD_LINE_4               LINE(4)
#define LCD_LINE_5               LINE(5)
#define LCD_LINE_6               LINE(6)
#define LCD_LINE_7               LINE(7)
#define LCD_LINE_8               LINE(8)
#define LCD_LINE_9               LINE(9)
#define LCD_LINE_10              LINE(10)
#define LCD_LINE_11              LINE(11)
#define LCD_LINE_12              LINE(12)
#define LCD_LINE_13              LINE(13)
#define LCD_LINE_14              LINE(14)
#define LCD_LINE_15              LINE(15)
#define LCD_LINE_16              LINE(16)
#define LCD_LINE_17              LINE(17)
#define LCD_LINE_18              LINE(18)
#define LCD_LINE_19              LINE(19)
#define LCD_LINE_20              LINE(20)
#define LCD_LINE_21              LINE(21)
#define LCD_LINE_22              LINE(22)
#define LCD_LINE_23              LINE(23)
#define LCD_LINE_24              LINE(24)
#define LCD_LINE_25              LINE(25)
#define LCD_LINE_26              LINE(26)
#define LCD_LINE_27              LINE(27)
#define LCD_LINE_28              LINE(28)
#define LCD_LINE_29              LINE(29)
#define LCD_LINE_30              LINE(30)
#define LCD_LINE_31              LINE(31)
#define LCD_LINE_32              LINE(32)
#define LCD_LINE_33              LINE(33)
#define LCD_LINE_34              LINE(34)
#define LCD_LINE_35              LINE(35)
#define LCD_LINE_36              LINE(36)
#define LCD_LINE_37              LINE(37)
#define LCD_LINE_38              LINE(38)
#define LCD_LINE_39              LINE(39)

/**
  * @brief LCD default font
  */
#define LCD_DEFAULT_FONT         Font16x24

/**
  * @brief  LCD Direction
  */
#define LCD_DIR_HORIZONTAL       0x0000
#define LCD_DIR_VERTICAL         0x0001

/**
  * @}
  */

/**
  * @brief  LCD Layer
  */
#define LCD_BACKGROUND_LAYER     0x0000
#define LCD_FOREGROUND_LAYER     0x0001

/**
  * @}
  */

/** @defgroup STM32F429I_DISCOVERY_LCD_Exported_Macros
  * @{
  */
#define ASSEMBLE_RGB(R, G, B)     ((((R)& 0xF8) << 8) | (((G) & 0xFC) << 3) | (((B) & 0xF8) >> 3))



/*部分液晶信號線的引腳複用編號是AF9*/
#define GPIO_AF_LTDC_AF9          ((uint8_t)0x09)


/**
  * @}
  */
//紅色數據線
#define LTDC_R0_GPIO_PORT        	GPIOH
#define LTDC_R0_GPIO_CLK         	RCC_AHB1Periph_GPIOH
#define LTDC_R0_GPIO_PIN         	GPIO_Pin_2
#define LTDC_R0_PINSOURCE        	GPIO_PinSource2
#define LTDC_R0_AF			          GPIO_AF_LTDC

#define LTDC_R1_GPIO_PORT        	GPIOH
#define LTDC_R1_GPIO_CLK         	RCC_AHB1Periph_GPIOH
#define LTDC_R1_GPIO_PIN         	GPIO_Pin_3
#define LTDC_R1_PINSOURCE        	GPIO_PinSource3
#define LTDC_R1_AF			          GPIO_AF_LTDC

#define LTDC_R2_GPIO_PORT        	GPIOH
#define LTDC_R2_GPIO_CLK         	RCC_AHB1Periph_GPIOH
#define LTDC_R2_GPIO_PIN         	GPIO_Pin_8
#define LTDC_R2_PINSOURCE        	GPIO_PinSource8
#define LTDC_R2_AF			          GPIO_AF_LTDC

#define LTDC_R3_GPIO_PORT        	GPIOB
#define LTDC_R3_GPIO_CLK         	RCC_AHB1Periph_GPIOB
#define LTDC_R3_GPIO_PIN         	GPIO_Pin_0
#define LTDC_R3_PINSOURCE        	GPIO_PinSource0
#define LTDC_R3_AF			          GPIO_AF_LTDC_AF9

#define LTDC_R4_GPIO_PORT        	GPIOA
#define LTDC_R4_GPIO_CLK         	RCC_AHB1Periph_GPIOA
#define LTDC_R4_GPIO_PIN         	GPIO_Pin_11
#define LTDC_R4_PINSOURCE        	GPIO_PinSource11
#define LTDC_R4_AF			          GPIO_AF_LTDC

#define LTDC_R5_GPIO_PORT        	GPIOA
#define LTDC_R5_GPIO_CLK         	RCC_AHB1Periph_GPIOA
#define LTDC_R5_GPIO_PIN         	GPIO_Pin_12
#define LTDC_R5_PINSOURCE        	GPIO_PinSource12
#define LTDC_R5_AF			          GPIO_AF_LTDC

#define LTDC_R6_GPIO_PORT        	GPIOB
#define LTDC_R6_GPIO_CLK         	RCC_AHB1Periph_GPIOB
#define LTDC_R6_GPIO_PIN         	GPIO_Pin_1
#define LTDC_R6_PINSOURCE        	GPIO_PinSource1
#define LTDC_R6_AF			          GPIO_AF_LTDC_AF9

#define LTDC_R7_GPIO_PORT        	GPIOG
#define LTDC_R7_GPIO_CLK         	RCC_AHB1Periph_GPIOG
#define LTDC_R7_GPIO_PIN         	GPIO_Pin_6
#define LTDC_R7_PINSOURCE        	GPIO_PinSource6
#define LTDC_R7_AF			          GPIO_AF_LTDC
//綠色數據線
#define LTDC_G0_GPIO_PORT        	GPIOE
#define LTDC_G0_GPIO_CLK         	RCC_AHB1Periph_GPIOE
#define LTDC_G0_GPIO_PIN         	GPIO_Pin_5
#define LTDC_G0_PINSOURCE        	GPIO_PinSource5
#define LTDC_G0_AF			          GPIO_AF_LTDC

